import MantarComponent from "../components/MantarComponent";

const mainheading = "अहिंसाः जीवेषणा की मृत्यु(अहिंसा)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "धर्म मंगल है। कौन सा धर्म? अहिंसा, संयम और तप। अहिंसा धर्म की आत्मा है। कल अहिंसा पर थोड़ी बातें मैंने आपसे कहीं, थोड़े और आयामों से अहिंसा को समझ लेना जरूरी है। <br> <br>हिंसा पैदा ही क्यों होती है? हिंसा जन्म के साथ ही क्यों जुड़ी है? हिंसा जीवन की पर्त-पर्त पर क्यों फैली है? जिसे हम जीवन कहते हैं, वह हिंसा का ही तो विस्तार है। ऐसा क्यों है? <br> <br>पहली बात, और अत्यधिक आधारभूत--वह है जीवेषणा। जीने की जो आकांक्षा है, उससे ही हिंसा जन्मती है। और जीने को हम सब आतुर हैं। अकारण भी जीने को आतुर हैं। जीवन से कुछ फलित भी न होता हो, तो भी जीना चाहते हैं। जीवन से कुछ न भी मिलता हो, तो भी जीवन को खींचना चाहते हैं। सिर्फ राख ही हाथ लगे जीवन में तो भी हम जीवन को दोहराना चाहते हैं। <br><br>विन्सेंट वॉनगाग के जीवन पर एक बहुत अदभुत किताब लिखी गई है। और किताब का नाम है--लस्ट फॉर लाइफ, जीवेषणा। अगर महावीर के जीवन पर कोई किताब लिखनी हो तो लिखना पड़ेगा, नो लस्ट फॉर लाइफ। जीवेषणा नहीं। जीने का एक पागल, अत्यंत विक्षिप्त भाव है हमारे मन में। मरने के आखिरी क्षण तक भी हम जीना ही चाहते हैं। और यह जो जीने की कोशिश है, यह जितनी विक्षिप्त होती है उतना ही हम दूसरे के जीवन के मूल्य पर भी जीना चाहते हैं। अगर ऐसा विकल्प आ जाए कि सारे जगत को मिटा कर भी, मुझे बचने की सुविधा हो तो मैं राजी हो जाऊंगा। सबको विनाश कर दूं, फिर भी मैं बच सकता होऊं तो मैं सबके विनाश के लिए तैयार हो जाऊंगा। जीवेषणा की इस विक्षिप्तता से ही हिंसा के सब रूप जन्मते हैं। मरने की आखिरी घड़ी तक भी आदमी जीवन को जोर से पकड़े रहना चाहता है। बिना यह पूछे हुए कि किसलिए? जीकर भी क्या होगा? जीकर भी क्या मिलेगा? <br><br>महावीर पूछते हैं, जीना ही क्यों हैं? व्हाय दिस लस्ट फार लाइफ? और इसी प्रश्न से महावीर का सारा चिंतन और सारी साधना निकलती है। <br><br>तो महावीर कहते हैं, यह जीने की बात ही पागलपन है। यह जीने की आकांक्षा ही पागलपन है। और इस जीने की आकांक्षा से जीवन बचता हो, ऐसा नहीं है; केवल दूसरों के जीवन को नष्ट करने की दौड़ पैदा होती है। बच जाता तो भी ठीक था। बचता भी नहीं है। कितना ही चाहो कि जीऊं, मौत खड़ी है और आ जाती है। कितने लोग इस जमीन पर हमसे पहले जीने की कोशिश कर चुके हैं। आखिर अंततः मौत ही हाथ लगती है। तो महावीर कहते हैं, जीवन का इतना पागलपन कि हम दूसरे को विनष्ट करने को तैयार हैं और अंत में मौत ही हाथ लगती है। महावीर कहते हैं--ऐसे जीवन के पागलपन को मैं छोड़ता हूं जिससे दूसरों के जीवन को नष्ट करने के लिए मैं तैयार होता और अपने को बचा भी नहीं पाता। जो व्यक्ति जीवेषणा छोड़ देता है वही अहिंसक हो सकता है। क्योंकि जब मुझे कोई आग्रह ही नहीं है कि जीऊं ही, तब मैं किसी का विनाश करने के लिए तैयार नहीं हो सकता। इसलिए महावीर की अहिंसा के प्राण में प्रवेश करना हो, तो वह प्राण है--जीवेषणा का त्याग। इसका यह अर्थ नहीं है कि महावीर मरने की आकांक्षा रखते हैं। यह भ्रांति हो सकती है। ";

const audio2 = "/mp3/ashinsamix.mp3"


const Ahinsha = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Ahinsha;



