import MantarComponent from "../components/MantarComponent";

const mainheading = "अनशनः मध्य के क्षण का अनुभव (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "बाह्य-तप में महावीर ने पहला तप कहा है--अनशन। अनशन के संबंध में जो भी समझा जाता है वह गलत है। अनशन के संबंध में जो छिपा हुआ सूत्र है, जो एसोटेरिक है वह मैं आपसे कहना चाहता हूं। उसके बिना अनशन का कोई अर्थ नहीं है। जो गुह्य अनशन की प्रक्रिया है वह मैं आपसे कहना चाहता हूं, उसे समझ कर आपको नई दिशा का बोध होगा। <br><br>मनुष्य के शरीर में दोहरे यंत्र हैं, डबल मैकेनिज्म हैं और दोहरा यंत्र इसलिए है ताकि इमर्जेंसी में, संकट के किसी क्षण में एक यंत्र काम न करे तो दूसरा कर सके। एक यंत्र तो जिससे हम परिचित हैं, हमारा शरीर। आप भोजन करते हैं, शरीर भोजन को पचाता है, खून बनाता है, हड्डियां बनाता है, मांस-मज्जा बनाता है। ये साधारण यंत्र हैं। लेकिन कभी कोई आदमी जंगल में भटक जाए या सागर में नाव डूब जाए और कई दिनों तक किनारा न मिले तो भोजन नहीं मिलेगा। तब शरीर के पास एक इमर्जेंसी अरेंजमेंट है, एक संकटकालीन व्यवस्था है, तब शरीर को भोजन तो नहीं मिलेगा लेकिन भोजन की जरूरत तो जारी रहेगी। क्योंकि श्वास भी लेना हो, हाथ भी हिलाना हो, जीना भी हो तो भोजन की जरूरत है। ईंधन की जरूरत है। आपको ईंधन न मिले तो आपके शरीर के पास एक ऐसी व्यवस्था चाहिए जो संकट की घड़ी में आपके शरीर के भीतर इकट्ठा जो ईंधन है उसको ही उपयोग में लाने लगे। शरीर के पास एक दूसरा इनर-मैकेनिज्म है। अगर आप सात दिन भूखे रहें तो शरीर अपने को ही पचाना शुरू कर देता है। भोजन आपको नहीं ले जाना पड़ता, आपके भीतर की चर्बी ही भोजन बननी शुरू हो जाती है। इसलिए उपवास में आपका एक पौंड वजन रोज गिरता चला जाएगा। वह एक पौंड आपकी ही चर्बी, आप पचा गए। कोई नब्बे दिन तक साधारण स्वस्थ आदमी मरेगा नहीं क्योंकि इतना रिजर्वायर, इतना संगृहीत तत्व शरीर के पास है कि कम से कम तीन महीने तक वह अपने को बिना भोजन के जिला सकता है। ये दो हिस्से हैं शरीर के--एक शरीर की व्यवस्था सामान्य है, दैनंदिन है। असमय के लिए, संकट की घड़ी के लिए एक और व्यवस्था है, जब शरीर बाहर से भोजन न पा सके तो अपने भीतर संगृहीत भोजन को पचाना शुरू कर दे। <br><br>अनशन की प्रक्रिया का राज यह है कि जब शरीर की एक व्यवस्था से दूसरी व्यवस्था पर संक्रमण होता है, आप बदलते हैं तब बीच में कुछ क्षणों के लिए आप वहां पहुंच जाते हैं जहां शरीर नहीं होता। वही उसका सीक्रेट है। जब भी आप एक चीज से दूसरे पर बदलाहट करते हैं, एक सीढ़ी से दूसरी सीढ़ी पर जाते हैं तो एक क्षण ऐसा होता है जब आप किसी भी सीढ़ी पर नहीं होते हैं। जब आप एक स्थिति से दूसरी स्थिति में छलांग लगाते हैं तो बीच में एक गैप, अंतराल हो जाता है जब आप किसी भी स्थिति में नहीं होते हैं, फिर भी होते हैं। <br><br>शरीर की एक व्यवस्था है सामान्य भोजन की, अगर यह व्यवस्था बंद कर दी जाए तो अचानक आपको दूसरी व्यवस्था पर रूपांतरित होना पड़ता है, और इस बीच कुछ क्षण हैं जब आप आत्म-स्थिति में होते हैं। उन्हीं क्षणों को पकड़ना अनशन का उपयोग है। इसलिए जो आदमी अनशन का अभ्यास करेगा वह अनशन का फायदा न उठा पाएगा। ख्याल रखें, जो अनशन का अभ्यास करेगा वह अनशन का फायदा न उठा पाएगा। अनशन सडन प्रयोग है, आकस्मिक, अचानक। जितना अचानक होगा, जितना आकस्मिक होगा, उतना ही अंतराल का बोध होगा। अगर आप अभ्यासी हैं तो आप इतने कुशल हो जाएंगे, एक स्थिति से दूसरी स्थिति में जाने में, कि बीच का अंतराल आपको पता ही नहीं चलेगा। इसलिए अभ्यासियों को अनशन से कोई लाभ नहीं होता। और अभ्यास करने की जो प्रक्रिया है वह यही है कि आपको बीच का अंतराल पता न चले। एक आदमी धीरे-धीरे अभ्यास करता रहे तो वह इतना कुशल हो जाता है कि कब उसने स्थिति बदल ली, उसे पता नहीं चलता। हम रोज स्थिति बदलते हैं लेकिन अभ्यास के कारण पता नहीं चलता। <br><br>रात आप सोते हैं--जागने के लिए शरीर दूसरे मैकेनिज्म का उपयोग करता है, सोने के लिए दूसरे। दोनों के मैकेनिज्म अलग हैं, दोनों का यंत्र अलग है। आप उसी यंत्र से नहीं जागते जिससे आप सोते हैं। इसीलिए तो अगर आपके जागने का यंत्र बहुत ज्यादा सक्रिय हो तो आप सो नहीं पाते। उसका और कोई कारण नहीं है, आप दूसरी व्यवस्था में प्रवेश नहीं कर पाते। पहली ही व्यवस्था में अटके रह जाते हैं। अगर आप दुकान, धंधे और काम की बात सोचे चले जा रहे हैं तो आपके जागने का यंत्र काम करता चला जाता है, जब तक वह काम करता है तब तक चेतना उससे नहीं हट सकती। चेतना तभी हटेगी, जब वहां आपका काम बंद हो जाए तो तत्काल शिफ्ट हो जाएगी। चेतना दूसरे यंत्र पर चली जाएगी, जो निद्रा का है। लेकिन हमें इतना अभ्यास है कि हमें पता नहीं चलता बीच के गैप का। वह जो जागने और नींद के बीच में जो क्षण आता है वह भी वही है जो भोजन छोड़ने और उपवास के बीच में आता है। इसलिए तो आपको नींद में भोजन की जरूरत नहीं पड़ती। आप दस घंटे सोए रहें तो भी भोजन की जरूरत नहीं पड़ती है। दस घण्टे जागें तो भोजन की जरूरत पड़ती है। ";

const audio2 = "/mp3/dharam2.mp3"


const Anshan = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Anshan;



