import MantarComponent from "../components/MantarComponent";







const url = "/img/mahaveer.jpg.jpg";

const content ="आचार्य का अर्थ हैः वह जिसने पाया भी और आचरण से प्रकट भी किया। आचार्य का अर्थः जिसका ज्ञान और आचरण एक है। ऐसा नहीं है कि सिद्ध का आचरण ज्ञान से भिन्न होता है। लेकिन शून्य हो सकता है। हो ही न, आचरण--शून्य ही हो जाए। ऐसा भी नहीं है कि अरिहंत का आचरण भिन्न होता है, लेकिन अरिहंत इतना निराकार हो जाता है कि आचरण हमारी पकड़ में न आएगा। हमें फ्रेम चाहिए जिसमें पकड़ में आ जाए। आचार्य से शायद हमें निकटता मालूम पड़ेगी। उसका अर्थ हैः जिसका ज्ञान आचरण है। क्योंकि हम ज्ञान को तो न पहचान पाएंगे, आचरण को पहचान लेंगे।";
const audio1 = "/mp3/acharya-1-1.mp3"

const wholeparagraph = "इससे खतरा भी हुआ। क्योंकि आचरण ऐसा भी हो सकता है जैसा ज्ञान न हो। एक आदमी अहिंसक न हो, अहिंसा का आचरण कर सकता है। एक आदमी अहिंसक हो तो हिंसा का आचरण नहीं कर सकता--वह तो असंभव है--लेकिन एक आदमी अहिंसक न हो और अहिंसा का आचरण कर सकता है। एक आदमी लोभी हो और अलोभ का आचरण कर सकता है। उलटा नहीं है, द वाइस वरसा इ.ज नॉट पासिबल। इससे एक खतरा भी पैदा हुआ। आचार्य हमारी पकड़ में आता है, लेकिन वहीं से खतरा शुरू होता है; जहां से हमारी पकड़ शुरू होती है, वहीं से खतरा शुरू होता है। तब खतरा यह है कि कोई आदमी आचरण ऐसा कर सकता है कि आचार्य मालूम पड़े। तो मजबूरी है हमारी। जहां से सीमाएं बननी शुरू होती हैं, वहीं से हमें दिखाई पड़ता है, वहीं से हमारे अंधे होने का डर है। <br><br>पर मंत्र का प्रयोजन यही है कि हम उनको नमस्कार करते हैं जिनका ज्ञान उनका आचरण है। यहां भी कोई विशेषण नहीं है। वे कौन? वे कोई भी हों। <br><br>आचरण और ज्ञान एक हैं जहां, उसे हम आचार्य कहते हैं। वह सिद्ध भी हो सकता है, वह अरिहंत भी हो सकता है। लेकिन हमारी पकड़ में वह आचरण से आता है। पर जरूरी नहीं है, क्योंकि आचरण बड़ी सूक्ष्म बात है और हम बड़ी स्थूल बुद्धि के लोग हैं। आचरण बड़ी सूक्ष्म बात है! तय करना कठिन है कि जो आचरण ";
const heading = "नमो आयरियाणं।";
const audio2 = "/mp3/acharya-1.mp3"


const Sidh = () => {
  return (
    <div>
      <MantarComponent
        heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Sidh;



