<<<<<<< HEAD
import MantarComponent from "../components/MantarComponent";

const mainheading = "धर्मः स्वभाव में होना (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "धर्म सर्वश्रेष्ठ मंगल है--तो अमंगल क्या है, दुख क्या है, मनुष्य की पीड़ा और संताप क्या है? उसे न समझें तो धर्म मंगल है, शुभ है, आनंद है--इसे भी समझना आसान न होगा। महावीर कहते हैं--धर्म सर्वश्रेष्ठ मंगल है। जीवन में जो भी आनंद की संभावना है, वह धर्म के द्वार से ही प्रवेश करती है। जीवन में जो भी स्वतंत्रता उपलब्ध होती है वह धर्म के आकाश में ही उपलब्ध होती है। जीवन में जो भी सौंदर्य के फूल खिलते हैं वे धर्म की जड़ों से ही पोषित होते हैं। और जीवन में जो भी दुख है वह किसी न किसी रूप में धर्म से च्युत हो जाने में, या अधर्म में संलग्न हो जाने में है। महावीर की दृष्टि में धर्म का अर्थ है--जो मैं हूं, उस होने में ही जीना है। जो मैं हूं, उससे जरा भी, इंच भर भी च्युत न होना है। <br><br>जो मेरा होना है, जो मेरा अस्तित्व है उससे जहां मैं बाहर जाता हूं, सीमा का उल्लंघन करता हूं। जहां मैं विजातीय से संबंधित होता हूं, जहां मैं उससे संबंधित होता हूं जो मैं नहीं हूं, वहीं दुख का प्रारंभ हो जाता है। और दुख का प्रारंभ इसलिए हो जाता है कि जो मैं नहीं हूं, उसे मैं कितना ही चाहूं, वह मेरा नहीं हो सकता। जो मैं नहीं हूं, उसे मैं कितना ही बचाना चाहूं, उसे मैं बचा नहीं सकता। वह खोएगा ही। जो मैं नहीं हूं, उस पर मैं कितना ही श्रम और मेहनत करूं, अंततः मैं पाऊंगा वह मेरा नहीं सिद्ध हुआ। श्रम हाथ लगेगा, चिंता हाथ लगेगी, जीवन का अपव्यय होगा और अंत में मैं पाऊंगा कि मैं खाली का खाली रह गया हूं। मैं केवल उसे ही पा सकता हूं जिसे मैंने किसी गहरे अर्थ में सदा से पाया ही हुआ है। मैं केवल उसका ही मालिक हो सकता हूं जिसका मैं जानूं न जानूं, अभी भी मालिक हूं। मृत्यु जिसे मुझसे नहीं छीन सकेगी, वही केवल मेरा है। देह मेरी गिर जाएगी तो भी जो नहीं गिरेगा, वही केवल मेरा है। रुग्ण हो जाएगा सब कुछ, दीन हो जाएगा सब कुछ, नष्ट हो जाएगा सब कुछ--फिर भी जो नहीं म्लान होगा, वही मेरा है। गहन अंधकार छा जाए, अमावस आ जाए जीवन में चारों तरफ--फिर भी जो अंधेरा नहीं होगा वही मेरा प्रकाश है। <br><br>लेकिन हम सब, जो मैं नहीं हूं, वहां खोजते हैं स्वयं को। वहीं से विफलता, वहीं से फ्रस्ट्रेशन, वहीं से विषाद जन्मता है। जो भी हम चाहते हैं, वह स्वयं को छोड़ कर सब हम चाहते हैं। हैरानी की बात है, इस जगत में बहुत कम लोग हैं जो स्वयं को चाहते हैं। शायद आपने इस भांति नहीं सोचा होगा कि आपने स्वयं को कभी नहीं चाहा, सदा किसी और को चाहा। <br><br>वह और, कोई व्यक्ति भी हो सकता है; वस्तु भी हो सकती है, कोई पद भी हो सकता है, कोई स्थिति भी हो सकती है; लेकिन सदा कोई और है, अन्य है--दि अदर। स्वयं को हममें से कोई भी कभी नहीं चाहता। और केवल एक ही संभावना है जगत में कि हम स्वयं को पा सकते हैं, और कुछ पा नहीं सकते। सिर्फ दौड़ सकते हैं। जिसे हम पा नहीं सकते और केवल दौड़ सकते हैं, उससे दुख आएगा। उससे डिसइल्युजनमेंट होगा, कहीं न कहीं भ्रम टूटेगा और ताश के पत्तों का घर गिर जाएगा। और कहीं न कहीं नाव डूबेगी, क्योंकि वह कागज की थी। और कहीं न कहीं हमारे स्वप्न बिखरेंगे और आंसू बन जाएंगे। क्योंकि वे स्वप्न थे। सत्य केवल एक है, और वह यह कि मैं स्वयं के अतिरिक्त इस जगत में और कुछ भी नहीं पा सकता हूं। हां, पाने की कोशिश कर सकता हूं। पाने का श्रम कर सकता हूं, पाने की आशा बांध सकता हूं, पाने के स्वप्न देख सकता हूं। और कभी-कभी ऐसा भी अपने को भरमा सकता हूं कि पाने के बिल्कुल करीब पहुंच गया हूं। लेकिन कभी पहुंचता नहीं, कभी पहुंच नहीं सकता हूं। <br><br>अधर्म का अर्थ है, स्वयं को छोड़कर और कुछ भी पाने का प्रयास। अधर्म का अर्थ है, स्वयं को छोड़ कर पर पर दृष्टि। और हम सब दि अदर ओरिएंटेड हैं। हमारी दृष्टि सदा दूसरे पर लगी है। और कभी अगर हम अपनी शक्ल भी देखते हैं तो वह भी दूसरे के लिए। अगर आईने के सामने खड़े होकर भी अपने को देखते हैं तो वह किसी के लिए--कोई जो हमें देखेगा--उसके लिए हम तैयारी करते हैं। स्वयं को हम सीधा कभी नहीं चाहते। और धर्म तो स्वयं को सीधे चाहने से उत्पन्न होता है। क्योंकि धर्म का अर्थ है स्वभाव--दि अल्टीमेट नेचर। वह जो अंततः, अंततोगत्वा मेरा, मेरा होना है, जो मैं हूं। ";

const audio2 = "/mp3/dharam2.mp3"


const Dharam = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
=======
// import { BigGradientText, CenterText } from "../Styles";

const Dharam = () => {
  return (
    <div className="bg-green-500">Dharam</div>

      // <CenterText>
      //   <BigGradientText>Dharam</BigGradientText>
      // </CenterText>
>>>>>>> c60fca01c9bc1ff1078bb5b84581ee8c9ec7da6d
  );
};

export default Dharam;
<<<<<<< HEAD



=======
>>>>>>> c60fca01c9bc1ff1078bb5b84581ee8c9ec7da6d
