import MantarComponent from "../components/MantarComponent";

const mainheading = "कायोत्सर्गः शरीर से विदा लेने की क्षमता (धम्म सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "महावीर के साधना सूत्रों में आज बारहवें और अंतिम तप पर बात करेंगे। अंतिम तप को महावीर ने कहा है--कायोत्सर्ग--शरीर का छूट जाना। मृत्यु में तो सभी का शरीर छूट जाता है। शरीर तो छूट जाता है मृत्यु में, लेकिन मन की आकांक्षा शरीर को पकड़े रखने की नहीं छूटती। इसलिए जिसे हम मृत्यु कहते हैं वह वास्तविक मृत्यु नहीं है, केवल नये जन्म का सूत्रपात है। मरते क्षण में भी मन शरीर को पकड़ रखना चाहता है। मरने की पीड़ा ही यही है कि जिसे हम नहीं छोड़ना चाहते हैं वह छूट रहा है। बेचैनी यही है कि जिसे हम पकड़ रखना चाहते हैं उसे नहीं पकड़ रख पा रहे हैं। दुख यही है कि जिसे समझा था कि मैं हूं, वही नष्ट हो रहा है। <br><br> मृत्यु में जो घटना सभी को घटती है, वही घटना ध्यान में उनको घटती है, जो ग्यारहवें चरण तक की यात्रा कर लिए होते हैं। ठीक मृत्यु जैसी ही घटना घटती है। कायोत्सर्ग का अर्थ है उस मृत्यु के लिए सहज स्वीकृति का भाव। वह घटेगी। जब ध्यान प्रगाढ़ होगा तो ठीक मृत्यु जैसी ही घटना घटेगी। लगेगा साधक को कि मिटा, समाप्त हुआ। इस क्षण में शरीर को पकड़ने का भाव न उठे, इसी की साधना का नाम कायोत्सर्ग है। ध्यान के क्षण में जब मृत्यु जैसी प्रतीति होने लगे तब शरीर को पकड़ने की अभीप्सा, आकांक्षा न उठे, शरीर का छूटता हुआ रूप स्वीकृत हो जाए, सहर्ष, शांति से, अहोभाव से, यह शरीर को विदा देने की क्षमता आ जाए, उस तप का नाम कायोत्सर्ग है। <br><br> मृत्यु और ध्यान की समानता को समझ लेना जरूरी है तभी कायोत्सर्ग समझ में आएगा। मृत्यु में यही होता है कि शरीर आपका चुक गया; अब और जीने, और काम करने में असमर्थ हुआ; तो आपकी चेतना शरीर को छोड़ कर हटती है, अपने स्रोत में सिकुड़ती है। लेकिन चेतना सिकुड़ती है स्रोत में फिर भी चित्त पकड़े रखना चाहते है। जैसे किनारा कोई आपके हाथ से खिसका जाता हो; जैसे नाव कोई आपसे दूर हटी जाती हो। शरीर को हम जोर से पकड़ रखना चाहते हैं, और शरीर व्यर्थ हो गया; चुक गया; तो तनाव पैदा होता है। जो जा रहा है उसे रोकने की कोशिश से तनाव पैदा होता है। उसी तनाव के कारण मृत्यु में मूर्च्छा आ जाती है। क्योंकि नियम है, एक सीमा तक हम तनाव को सह सकते हैं, एक सीमा के बाहर तनाव बढ़ जाए तो चित्त मूर्च्छित हो जाता है, बेहोश हो जाता है। <br><br> मृत्यु में इसीलिए हर बार हम बेहोश मरते हैं। और इसलिए अनेक बार मर जाने के बाद भी हमें याद नहीं रहता कि हम पीछे भी मर चुके हैं। और इसलिए हर जन्म नया जन्म मालूम होता है। कोई जन्म नया जन्म नहीं है। सभी जन्मों के पीछे मौत की घटना छिपी है। लेकिन हम इतने बेहोश हो गए होते हैं कि हमारी स्मृति में उसका कोई निशान नहीं छूट जाता। और यही कारण है कि हमें पिछले जन्म की स्मृति भी नहीं रह जाती, क्योंकि मृत्यु की घटना में हम इतने बेहोश हो जाते हैं, वही बेहोशी की पर्त हमारे पिछले जन्म की स्मृतियों को हमसे अलग कर देती है। एक दीवाल खड़ी हो जाती है। हमें कुछ भी याद नहीं रह जाता। फिर हम वही शुरू कर देते हैं जो हम बार-बार शुरू कर चुके हैं। <br><br> ध्यान में भी यही घटना घटती है, लेकिन शरीर के चुक जाने के कारण नहीं, मन की आकांक्षा के चुक जाने के कारण, यह फर्क होता है। शरीर तो अभी भी ठीक है लेकिन मन की शरीर को पकड़ने की जो वासना है वह चुक गई। अब कोई मन पकड़ने का न रहा। तो शरीर और चेतना अलग हो जाते हैं, बीच का सेतु टूट जाता है। जोड़ने वाला हिस्सा है मन, आकांक्षा, वासना वह टूट जाती है। जैसे कोई सेतु गिर जाए और नदी के दोनों किनारे अलग हो जाएं, ऐसे ही ध्यान में विचार और वासना के गिरते ही चेतना अलग और शरीर अलग हो जाता है। उस क्षण तत्काल हमें लगता है कि मृत्यु घटित हो रही है। और साधक का मन होता है--वापस लौट चलूं, यह तो मौत आ गई। और अगर साधक वापस लौट जाए तो बारहवां चरण घटित नहीं हो पाता। अगर साधक वापस लौट जाए तो ध्यान भी अपनी पूरी परिणति पर नहीं पहुंच पाता। अगर साधक वापस लौट जाए भयभीत होकर इस बारहवें चरण से, तो सारी साधना व्यर्थ हो जाती है। इसलिए महावीर ने ध्यान के बाद कायोत्सर्ग को अंतिम तप कहा है। <br><br> जब यह सेतु टूटे तो इसे खड़े हुए देखते रहना कि सेतु टूट रहा है। और जब शरीर और चेतना अलग हो जाएं ध्यान में तो भयभीत न होना। अभय से साक्षी बने रहना। एक क्षण की ही बात है। एक क्षण ही अगर कोई ठहर गया कायोत्सर्ग में, तो फिर कोई भय नहीं रह जाता। फिर तो मृत्यु भी नहीं रह जाती। जैसे ही शरीर और चेतना एक क्षण को भी अलग होकर दिखाई पड़ गए, उसी दिन से मृत्यु का सारा भय समाप्त हो गया। क्योंकि अब आप जानते हैं आप शरीर नहीं है, आप कोई और हैं। और जो आप हैं, शरीर नष्ट हो जाए तो भी वह नष्ट नहीं होता है। यह प्रतीति, यह अमृत का अनुभव, यह मृत्यु के जो अतीत है उस जगत में प्रवेश कायोत्सर्ग के बिना नहीं होता है। ";

const audio2 = "/mp3/dharam2.mp3"


const Kayautsarg = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Kayautsarg;



