import MantarComponent from "../components/MantarComponent";

const mainheading = "काया-क्लेश (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "रस-परित्याग के बाद महावीर ने कहा है--काया-क्लेश। यह महावीर के साधना सूत्रों में सबसे ज्यादा गलत समझा गया साधना सूत्र है। काया-क्लेश शब्द साफ है। लगता है--शरीर को कष्ट दो, का या को क्लेश दो, काया को सताओ; लेकिन महावीर सताने की किसी भी बात में गवाही नहीं हो सकते। क्योंकि सब सताना हिंसा है। अपना ही शरीर सताना भी हिंसा है, क्योंकि महावीर कहते हैं--वह भी तुम्हारा है! सच तुम्हारा है जो तुम उसे सता सकोगे? पदार्थ पर है। मेरे शरीर में जो खून की धारा दौड़ रही है वह उतनी ही मुझसे दूर है जितनी आपके शरीर में खून की धारा दौड़ रही है। मेरे शरीर में जो हड्डी है, वह भी मैं नहीं हूं। उतना ही मैं नहीं हूं जितना आपके शरीर की हड्डी मैं नहीं हूं। और जब मेरे शरीर की हड्डी निकाल कर और आपके शरीर की हड्डी निकाल कर रख दी जाए तो मैं पता भी न लगा पाऊंगा कि कौन सी मेरी हड्डी है--कि लगा पाऊंगा? कोई पता न लगेगा। हड्डी सिर्फ हड्डी है। वह मेरी-तेरी नहीं है। और मेरी हड्डी जिस नियम से बनती है उसी नियम से आपकी हड्डी भी बनती है। वह सब बाहर की ही व्यवस्था है। <br><br>तो महावीर अपने शरीर को भी सताने की बात नहीं कह सकते क्योंकि महा वीर भलीभांति जानते हैं कि अपना वहां क्या है? वहां भी सब पराया है। सिर्फ डिस्टेंस का फासला है। मेरा शरीर मुझसे थोड़ा कम दूरी पर, आपका शरीर मुझसे थोड़ी ज्यादा दूरी पर है, बस इतना ही फासला है। और तो कोई फासला नहीं है। पर महावीर की परंपरा ने ऐसा ही समझा कि काया को सताओ, और इसलिए मेसोचिस्ट का, आत्मपीड़कों का बड़ा वर्ग महावीर की धारा में सम्मिलित हुआ। जिन-जिन को लगता था कि अपने को सताने में मजा आ सकता है वे सम्मिलित हुए। <br><br>अब ध्यान रहे, महावीर ने अपने बालों का लोंच किया, अपने बाल उखाड़ कर फेंक दिए। क्योंकि महावीर कहते थे--अब बालों को उखाड़ने के लिए भी कोई साधन पास में रखना पड़े, कोई रेजर साथ रखो या किसी नाई पर निर्भर रहो, या नाई के यहां क्यू लगा कर खड़े हो, महावीर ने कहा, फिजूल-फिजूल समय इसमें खोना जरूरी नहीं है। महावीर अपने बाल उखाड़ देते थे। लेकिन महावीर बाल उखाड़ते थे इसलिए नहीं कि बाल उखाड़ने में जो पीड़ा होती थी उस पीड़ा में उन्हें कोई रस था। सच तो यह है कि महावीर को बाल उखाड़ने में पीड़ा नहीं होती थी। यह थोड़ा समझने जैसा है। आपके शरीर में बाल और नाखून डेडपार्ट्स हैं, जिंदा हिस्से नहीं हैं। नाखून और बाल मरे हुए हिस्से हैं इसलिए तो कैंची से काट कर दर्द नहीं होता। अंगुली काटिए! बाल कैंची से कटता है, आपको दर्द क्यों नहीं होता? इफ इट इ.ज ए पार्ट--अगर आपका ही हिस्सा है तो दर्द होना चाहिए, यदि वह जिंदा है तो दर्द होना चाहिए। लेकिन आपके बाल कटते रहते हैं, आपको पता भी नहीं चलता। बाल मरा हुआ हिस्सा है। असल में शरीर में जो जीव कोष मर जाते हैं उन कोषों को बाहर निकालने की तरकीब है--बाल और ना खून और अनेक तरह से, पसीने से, और सब तरह से। शरीर के मरे हुए कोष शरीर बाहर फेंक देता है। तो बाल आपके शरीर के मरे हुए कोष हैं। अगर मरे हुए कोषों को भी खींचने से पीड़ा होती है तो वह भ्रांति है सिर्फ। वह सिर्फ ख्याल है कि पीड़ा होगी, इसलिए होती है। <br><br>आप कहेंगे, क्या सारे लोग भ्रांति में हैं? तो मैं आपको एक छोटी सी वैज्ञानिक घटना कहूं जिससे ख्याल में आए। फ्रांस में एक आदमी है, लोरेंजो। उसने पीड़ारहित प्रसव के हजारों प्रयोग किए। कोई अब तक वह एक लाख स्त्रियों को बिना दर्द के प्रसव करवाया है। बिना कोई दवा दिए, बिना कोई अनस्थेसिया दिए, बिना बेहोश किए। जैसी स्त्री है वैसी ही उसे लिटा कर बिना दर्द के बच्चे को पैदा करवा देता है। वह कहता है--सिर्फ यह भ्रांति है कि बच्चे के पैदा होने में दर्द होता है, यह सिर्फ ख्याल है। और चूंकि यह ख्याल है इसलिए जब मां को बच्चा होने के करीब आता है तब वह भयभीत होनी शुरू हो जाती है कि अब दर्द होने वाला है। अब दर्द होगा। और चूंकि दर्द जब भी ख्याल में आता है तो वह अपनी पूरी मांस-पेशियों को भीतर सिकोड़ने लगती है। <br><br>दर्द सिकोड़ता है--ध्यान रहे, सुख फैलाता है, दुख सिकोड़ता है। जब आप दुख में होते हैं तो सिकुड़ते हैं। अगर एक आदमी आपकी छाती पर छुरा लेकर खड़ा हो जाए, आपकी सब मांस-पेशियां भीतर सिकुड़ जाती हैं। कोई आपके गले में फूलमाला डाल दे, आपका सब फैल जाता है। फूलमाला डलवा कर कभी वजन मत तुलवाना, ज्यादा निकल सकता है। आप हैरान होंगे, यह वैज्ञानिक निरीक्षित तथ्य है कि भगतसिंह का वजन फांसी पर बढ़ गया। जेल में तौला गया और जेल से ले जाकर फांसी के तख्ते पर तौला गया, फांसी लगने वाली थी तो भगतसिंह का वजन कोई डेढ़ पौंड बढ़ गया। यह कैसे बढ़ गया? भगतसिंह इतना आनंदित था कि फैल सकता है। जब आप दुख में होते हैं तो अपने को आप सिकोड़ते हैं रक्षा के लिए। ";

const audio2 = "/mp3/dharam2.mp3"


const Kayakalesh = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Kayakalesh;



