<<<<<<< HEAD
import MantarComponent from "../components/MantarComponent";

const mainheading = "लोकोत्तर की भावना (भाव-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "महावीर कहते हैं कि वस्तु का जो स्वभाव है वही धर्म है, नेचर। धर्म का महावीर का वही अर्थ है जो लाओत्से ताओ का। वस्तु का जो स्वभाव है, जो उसकी स्वयं की अपनी परिणति है--अगर कोई व्यक्ति बिना किसी से प्रभावित हुए सहज वरण-चरण कर पाए तो धर्म को उपलब्ध हो जाता है--अगर कोई व्यक्ति बिना प्रभावित हुए। इसलिए प्रभाव को महावीर अच्छी बात नहीं मानते। किसी से भी प्रभावित होना बंधना है। सब इंप्रेशंस बांधने वाले हैं। पूर्णतया अप्रभावित हो जाना निज हो जाना है, स्वयं हो जाना है। इस निजता को, इस स्वयं होने को वे धर्म कहते हैं। केवली प्ररूपित धर्म का अर्थ होता है, जब कोई व्यक्ति केवल ज्ञान मात्र रह जाता है, चेतना मात्र रह जाता है। तब वह जैसे जीता है वही धर्म है। उसका जीवन, उसका उठना, उसका बैठना, उसका हलन-चलन, उसका सोना--वह जो भी करता है--उसकी आंख की पलक का उठना और हिलना, उसकी समस्त अस्तित्व में प्रकट होती हुई जो भी किरणें हैं--वही धर्म है।  <br><br>जैसे अग्नि अपने शुद्ध रूप में जलती हो तो धुआं पैदा नहीं होता। आप कहेंगे--अग्नि तो जहां भी जलती है, वहां धुआं पैदा होता है। और तर्क की किताब में लिखा हुआ है--जहां-जहां धुआं, वहां-वहां अग्नि। इसलिए जहां धुआं दिखे, मान लेना कि अग्नि है। लेकिन धुआं अग्नि से पैदा नहीं होता, केवल ईंधन के गीलेपन से पैदा होता है। अग्नि से उसका कोई लेना-देना नहीं है। अगर इंर्धन बिल्कुल गीला न हो तो धुआं पैदा नहीं होता। धुआं अग्नि का स्वभाव नहीं है, ईंधन का प्रभाव है--जब ईंधन गीला होता है तब पैदा होता है। तो कहना चाहिए--वह पानी से पैदा होता है, वह अग्नि से पैदा नहीं होता--धुआं। अगर बिल्कुल सूखा ईंधन है, जिसमें पानी जरा भी नहीं है तो धुआं पैदा नहीं होगा। और अगर पैदा होता है तो जानना कि थोड़ा-बहुत ईंधन गीला है। अग्नि जब अपने शुद्ध रूप में होती है, जब उसमें कोई दूसरा विजातीय, फारिन एलीमेंट नहीं होता--तब उसमें कोई धुआं नहीं होता। <br><br>महावीर कहते हैं--तब अग्नि अपने धर्म में है, जब कोई धुआं नहीं है। जब चेतना बिल्कुल शुद्ध होती है और पदार्थ का कोई प्रभाव नहीं होता, शरीर का पता भी नहीं होता--जब चेतना इतनी शुद्ध होती है कि शरीर का पता भी नहीं होता है। तब महावीर कहते हैं कि, जानना कि चेतना अपने धर्म में है। इसलिए महावीर कहते हैं--प्रत्येक का अपना धर्म है--अग्नि का अपना है; जल का अपना है; पदार्थ का अपना है; चेतना का अपना है। शुद्ध हो जाना अपने धर्म में--आनंद है; अशुद्ध रहना अपने धर्म में दुख है। तो धर्म का यहां अर्थ है, स्वभाव। अपने स्वभाव में चले जाना धार्मिक हो जाना है, और अपने स्वभाव के बाहर भटकते रहना अधार्मिक बने रहना है।   <br><br>लोक में इन चारों को उत्तम भी इस सूत्र में कहा है। अरिहंत उत्तम हैं लोक में, सिद्ध उत्तम हैं लोक में, साधु उत्तम हैं लोक में, केवली प्ररूपित धर्म उत्तम है लोक में। मंगल कह देने के बाद उत्तम की क्या जरुरत है? कारण है हमारे भीतर। ये सारे सूत्र हमारे मनस के ऊपर आधारित हैं। यह हमारे मन की गहराइयों के अध्ययन पर आधारित है। मंगल कहने के बाद भी हम इतने नासमझ हैं कि जो उत्तम नहीं है उसे भी हम मंगलरूप मान सकते हैं। हमारी वासनाएं ऐसी हैं कि जो निकृष्ट है लोक में उसी की तरफ बहती हैं। ऐसा भी कह सकते हैं कि वासना का अर्थ ही यही होता है--नीचे की तरफ बहाव। जो निकृष्ट है उसी की तरफ। "


;

const audio2 = "/mp3/lagutma1.mp3"


const Lokotarkibhavna = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
=======
// import { BigGradientText, CenterText } from "../Styles";

const Lokotarkibhavna = () => {
  return (
    <div className="bg-green-500">Lokotarkibhavna</div>
      // <CenterText>
      //   <BigGradientText>Lokotarkibhavna</BigGradientText>
      // </CenterText>
>>>>>>> c60fca01c9bc1ff1078bb5b84581ee8c9ec7da6d
  );
};

export default Lokotarkibhavna;



