import MantarComponent from "../components/MantarComponent";

const mainheading = "मंगल की भावना (मंगल-भाव-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="अरिहंता मंगलं।<br>सिद्धा मंगलं। <br>साहू मंगलं। <br>केवलिपन्नत्तो धम्मो मंगलं।। <br>अरिहंत मंगल हैं। सिद्ध मंगल हैं। साधु मंगल हैं।<br>केवलीप्ररूपित अर्थात आत्मज्ञकथित धर्म मंगल है। ";
const audio1 = "/mp3/mangal-lagutma1.mp3"

const wholeparagraph = "महावीर ने कहा है--जिसे पाना हो उसे देखना शुरू करना चाहिए। क्योंकि हम उसे ही पा सकते हैं जिसे हम देखने में समर्थ हो जाएं। जिसे हमने देखा नहीं, उसे पाने का भी कोई उपाय नहीं। जिसे खोजना हो, उसकी भावना करनी प्रारंभ कर लेनी चाहिए। क्योंकि इस जगत में हमें वही मिलता है, जो मिलने के भी पहले, जिसके लिए हम अपने ह्नदय में जगह बना लेते हैं। अतिथि घर आता हो तो हम इंतजाम कर लेते हैं उसके स्वागत का। अरिहंत को निर्मित करना हो स्वयं में, सिद्ध को पाना हो कभी, किसी क्षण स्वयं भी केवली बन जाना हो तो उसे देखना, उसकी भावना करनी, उसकी आकांक्षा और अभीप्सा की तरफ चरण उठाने शुरू करने जरूरी हैं। <br><br>महावीर से ढाई हजार साल पहले चीन में एक कहावत प्रचलित थी। और वह कहावत थी लाओत्से के द्वारा कही गई और बाद में संगृहीत की गई चिंतन की धारा का पूरा का पूरा सार वह कहावत थी दि सुपीरियर फिजिशियन क्योर्स दि इलनेस बिफोर इट इ.ज मैनिफेस्टेड जो श्रेष्ठ चिकित्सक है वह बीमारी के प्रकट होने के पहले ही उसे ठीक कर देता है। द इनफीरियर फिजिशियन ओनली केयर्स फॉर द इलनेस व्हिच ही वा.ज नॉट एबल टु प्रिवेंट और, जो साधारण चिकित्सक है वह केवल बीमारी को दूर करने में थोड़ी बहुत सहायता पहुंचाता है, जिसे वह रोकने में समर्थ नहीं था। <br><br>महावीर कहते थे की मंगल की कामना में डुबे रहो चौबीस घंटे उठते, बैठते, श्वास लेते, छोड़ते। स्वभावता मंगल की कामना शिखर से शुरू करनी चाहिए इसलिए वे कहते हैं अरिहंत मंगल हैं। वे जिनके आंतरिक समस्त रोग समाप्त हो गए, वे मंगल हैं। सिद्ध मंगल हैं, साधु मंगल हैं, और जाना जिन्होंने--जैन परंपरा केवली उन्हें कहती है जो जानने की दिशा में उस जगह पहुंच गए जहां जानने वाला भी नहीं रह जाता, जानी जाने वाली वस्तु भी नहीं रह जाती, सिर्फ जानना रह जाता है, सिर्फ केवल ज्ञान मात्र रह जाता है--ओनली नोइंग। केवली, जैन परंपरा उसे कहती है जो केवल ज्ञान को उपलब्ध हो गया। मात्र ज्ञान रह गया है जहां। जहां कोई जानने वाला न बचा, जहां मैं का कोई भाव न बचा, जहां कोई ज्ञेय न बचा, जहां कोई तू न बचा। जहां सिर्फ जानने की शुद्ध क्षमता, प्योर कैपेसिटी टु नो। <br><br>इसे ऐसा समझें कि हम एक कमरे में दीया जलाएं। दीये की बाती है, तेल है, दीया है। फिर कमरे में दीये का प्रकाश है और उस प्रकाश से प्रकाशित होती चीजें हैं--कुर्सी है, फर्नीचर है, दीवाल है, आप हैं। अगर हम ऐसी कल्पना कर सकें कि कमरा शून्य हो गया--न दीवाल है, न फर्नीचर है, कुछ भी नहीं है। दीये में तेल भी न रहा, दीये की देह भी न रही--सिर्फ ज्योति रह गई, प्रकाश मात्र रह गया, न कोई दीया बचा और न प्रकाशित वस्तुएं बचीं--मात्र प्रकाश रह गया। अलोक, स्रोत-रहित, कोई तेल नहीं, कोई बाती नहीं। और ऐसा आलोक जो किसी पर नही पड़ रहा है, शून्य में फैल रहा है, ऐसी धारणा है जैन चिंतन की केवली के संबंध में। जो परम ज्ञान को उपलब्ध होता है वहां ज्ञान अकारण हो जाता है, कोई सोर्स नाहीं होता। क्योंकि बात बहुत कीमती है। जैन परंपरा कहती है कि जिस चीज का भी सोर्स होता है वह कभी न कभी चुक जाती है। चुक ही जाएगी। कितना ही बड़ा स्रोत क्यों न हो। सूर्य भी चुक जाएगा एक दिन बड़ा है स्रोत हो, अरबों वर्षों से रोशनी दे रहा है। वैज्ञानिक कहते हैं अभी और अंदाजन चार हजार, पांच हजार साल रोशनी देगा, लेकिन चुक जाएगा। कितना ही बड़ा स्त्रोत हो, स्त्रेत की सीमा है चुक जाएगा। <br><br> महावीर कहते हैं--यह जो चेतना है, यह अनंत है, यह कभी चुक नहीं सकती। यह स्त्रोतरहित है इसमें जो प्रकाश है वह किसी मार्ग से नहीं आता, वह बस हैइट जस्ट इ.ज। कहीं से आता नहीं, अन्यथा एक दिन चुक जाएगा। कितना ही बड़ा हो, चुक जाएग। महासागर भी चम्मचों से उलीचकर चुकाए जा सकते हैं--कितना ही लंबा समय लगे। महासागर भी चम्मचों से उलीच कर चुकाए जा सकते हैं। एक चम्मच थोड़ा तो कम कर ही जाती है। फिर और ज्यादा कम होता जाएगा। महावीर कहते हैं--यह जो चेतना है, यह स्रोत-रहित है। इसलिए महावीर ने ईश्वर को मानने से इनकार कर दिया। क्योंकि अगर ईश्वर को मानें तो ईर्श्वर स्त्रोत हो जाता है। और हम सब उसी के स्त्रोत से जलने वाले दीये हो जाते हैं तो हम चुक जाएंगे। <br><br>सच यह है कि महावीर से ज्यादा प्रतिष्ठा आत्मा को इस पृथ्वी पर और किसी व्यक्ति ने कभी नहीं दी है। इतनी प्रतिष्ठा कि उन्होंने कहा कि परमात्मा अलग नहीं, आत्मा ही परमात्मा है। इसका स्रोत अलग नहीं है, यह ज्योति ही स्वयं स्रोत है। यह जो भीतर जलने वाला जीवन है, यह कहीं से शक्ति नहीं पाता यह स्वयं ही शक्तिवान है। यह किसी के द्वारा निर्मित नहीं है, नहीं तो किसी के द्वारा नष्ट हो जाएगा। यह किसी पर निर्भर नहीं है, नहीं तो मोहताज रहेगा। यह किसी से कुछ भी नहीं पाता, यह स्वयं में समर्थ और सिद्ध है। जिस दिन ज्ञान इस सीमा पर पहुंचता है, जहां हम स्रोत-रहित प्रकाश को उपलब्ध होते हैं, सोर्सलेस--उसी दिन हम मूल को उपलब्ध होते हैं। जैन परंपरा ऐसे व्यक्ति को केवली कहती है। वह व्यक्ति कहीं भी पैदा हो--वे क्राइस्ट हो सकते हैं, वे बुद्ध हो सकते हैं, वे कृष्ण हो सकते हैं, वे लाओत्से हो सकते हैं। इसलिए इस सूत्र में यह नहीं कहा गया महावीर मंगलं, कृष्ण मंगलं--ऐसा नहीं कहा।  जैन धर्म मंगल है, ऐसा नहीं कहा। हिंदू धर्म मंगल है, ऐसा नहीं कहा। केवली पन्नत्तो धम्मो मंगलं वे जो केवल ज्ञान को उपलब्ध हो गए, उनके द्वारा जो भी प्ररूपित धर्म है, वह मंगल है। वह कहीं भी हो, जिन्होंने भी शुद्ध ज्ञान को पा लिया, उन्होंने जो कहा है, वह मंगल है। <br><br>यह मंगल की धारणा गहन प्राणों के अतल में बैठ जाए तो अमंगल की संभावना कम होती चली जाती <br><br>यह मंगल की धारणा गहन प्राणों के अतल में बैठ जाए तो अमंगल की संभावना कम होती चली जाती है। जैसी जो भावना करता है, धीरे-धीरे वैसा ही हो जाता है। जैसा हम सोचते हैं, वैसे ही हम हो जाते हैं। जो हम मांगते हैं, वह मिल जाता है।  ";

const audio2 = "/mp3/mangal2+5.mp3"


const Mangalkibhavna = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Mangalkibhavna;



