import MantarComponent from "../components/MantarComponent";

const mainheading = "प्रायश्चित्तः पहला अंतर तप (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "तप के छह बाह्य अंगों की हमने चर्चा की है, आज से अंतर-तपों के संबंध में बात करेंगे। महावीर ने पहला अंतर-तप कहा है--प्रायश्चित्त। पहले तो हम समझ लें कि प्रायश्चित्त क्या नहीं हैं तो आसान होगा समझना कि प्रायश्चित्त क्या है? अब कठिनाई और भी बढ़ गई है क्योंकि प्रायश्चित्त जो नहीं है वही हम समझते रहे हैं कि प्रायश्चित्त है। शब्दकोशों में खोजने जाएंगे तो लिखा है कि प्रायश्चित्त का अर्थ है-पश्चात्ताप, रिपेंटेंस। प्रायश्चित्त का वह अर्थ नहीं है। पश्चात्ताप और प्रायश्चित्त में इतना अंतर है जितना जमीन और आसमान में। <br><br>पश्चात्ताप का अर्थ हैः जो आपने किया है उसके लिए पछतावा; लेकिन जो आप हैं उसके लिए पछतावा नहीं, जो आपने किया है उसके लिए पछतावा। आपने चोरी की है तो आप पछता लेते हैं चोरी के लिए। आपने हिंसा की है तो आप पछता लेते हैं हिंसा के लिए। आपने बेईमानी की है तो पछता लेते हैं बेईमानी के लिए। आ पके लिए नहीं, आप तो ठीक हैं। आप ठीक आदमी से एक छोटी सी भूल हो गई थी कर्म में, उसे आपने पश्चात्ताप करके पोंछ दिया। <br><br>इसलिए पश्चात्ताप अहंकार को बचाने की प्रक्रिया है। क्योंकि अगर भूलें आपके पास बहुत इकट्ठी हो जाएं तो आपके अहंकार को चोट लगनी शुरू होगी--कि मैं बुरा आदमी हूं, कि मैंने गाली दी। कि मैं बुरा आदमी हूं, कि मैंने क्रोध किया। आप हैं बहुत अच्छे आदमी--गाली आप दे नहीं सकते हैं, किसी परिस्थिति में निकल गई होगी। आप पछता लेते हैं और फिर से अच्छे आदमी हो जाते हैं। पश्चात्ताप आपको बदलता नहीं, जो आप हैं वही रखने की व्यवस्था है। इसलिए रोज आप पश्चात्ताप करेंगे और रोज आप पाएंगे कि आप वही कर रहे हैं जिसके लिए कल पछताए थे। पश्चात्ताप आ पके बीइंग, आपकी अंतरात्मा में कोई अंतर नहीं लाता, सिर्फ आपके कृत्यों में कहीं भूल थी, और भूल भी इसलिए मालूम पड़ती है कि उससे आप अपनी इमेज को, अपनी प्रतिमा को जो आपने समझ रखी है, बनाने में असमर्थ हो जाते हैं।<br><br>मैं एक अच्छा आदमी हूं, ऐसी मैं, मेरी अपनी प्रतिमा बनाता हूं। फिर इस अच्छे आदमी के मुंह से एक गाली निकल जाती है, तो मेरे ही सामने मेरी प्रतिमा खंडित होती है। मैं पछताना शुरू करता हूं कि यह कैसे हुआ कि मैंने गाली दी। मैं कहना शुरू करता हूं कि मेरे बावजूद यह हो गया, इन्सपाइट ऑफ मी। यह मैं चाहता नहीं था और हो गया। ऐसा मैं कर नहीं सकता हूं और हो गया--किसी परिस्थिति के दबाव में, किसी क्षण के आवेश में। ऐसा मैं हूं नहीं कि जिससे गाली निकले, और गाली निकल गई। मैं पछता लेता हूं। गाली का जो क्षोभ था वह बिदा हो जाता है। मैं अपनी जगह वापस लौट आता हूं जहां मैं गाली के पहले था। पश्चात्ताप वहीं ला देता है वापस जहां मैं गाली के पहले था। लेकिन ध्यान रखें, जहां मैं गाली के पहले था, उसी में से गा ली निकली थी। मैं फिर उसी जगह वापस लौट आया। उससे फिर गाली निकलेगी।";

const audio2 = "/mp3/dharam2.mp3"


const Prashachit = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Prashachit;



