import MantarComponent from "../components/MantarComponent";

const mainheading = "रस-परित्याग (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "बाह्य-तप का चौथा चरण है--रस-परित्याग। परंपरा रस-परित्याग से अर्थ लेती रही है। किन्हीं रसों का, किन्हीं स्वादों का निषेध, नियंत्रण। इतनी स्थूल बात रस-परित्याग नहीं है। वस्तुतः सधना के जगत में स्थूल से स्थूल दिखाई पड़ने वाली बात भी स्थूल नहीं होती। कितने ही स्थूल शब्दों का प्रयोग किया जाए बात तो सूक्ष्म ही होती है। मजबूरी है कि स्थूल शब्दों का प्रयोग करना पड़ता है, क्योंकि सूक्ष्म के लिए कोई शब्द नहीं है। वह जो अंतर्जगत है, वहां इशारे करने वाले कोई शब्द हमारे पास नहीं हैं। अंतर्जगत की कोई भाषा नहीं है। इसलिए बाह्य जगत के ही शब्दों का प्रयोग करना मजबूरी है। उस मजबूरी से खतरा भी पैदा होता है क्योंकि तब उन शब्दों का स्थूल अर्थ लिया जाना शुरू हो जाता है। रस-परित्याग से यही लगता है कि कभी खट्टे का त्याग कर दो; कभी मीठे का त्याग कर दो; कभी घी का त्याग कर दो; कभी कुछ और त्याग कर दो। रस-परित्याग से ऐसा प्रयोजन महावीर का नहीं है। महावीर का क्या प्रयोजन है, वह दो-तीन हिस्सों में समझ लेना जरूरी है। <br><br>पहली बात तो यह कि रस की पूरी प्रक्रिया क्या है? जब आप कोई स्वाद लेते हैं तो स्वाद वस्तु में होता है या स्वाद आपकी स्वाद इंद्रिय में होता है? या स्वाद स्वादेंद्रिय के पीछे वह जो आपका अनुभव करने वाला मन है, उसमें होता है? या स्वाद उस मन के साथ आपकी चेतना का जो तादात्म्य है उसमें होता है? स्वाद कहां है? रस कहां है? तभी परित्याग ख्याल में आ सकेगा। जो स्थूल देखते हैं उन्हें लगता है कि स्वाद या रस वस्तु में होता है, इसलिए वस्तु को छोड़ दो। वस्तु में स्वाद नहीं होता, न रस होता है; वस्तु केवल निमित्त बनती है। और अगर भीतर रस की पूरी प्रक्रिया काम न कर रही हो तो वस्तु निमित्त बनने में असमर्थ है। जैसे आपको फांसी की सजा दी जा रही हो और आपको मिष्ठान्न खाने को दे दिया जाए, तो भी मीठा नहीं लगेगा। मिष्ठान्न अब भी मीठा ही है, और जो मीठे को भोग सकता था, वह एकदम अनुपस्थित हो गया है। स्वादेंद्रिय अब भी खबर देगी क्योंकि स्वादेंद्रिय को कोई भी पता नहीं है कि फांसी लग रही है, न पता हो सकता है। स्वादेंद्रिय के संवेदनशील तत्व अब भी भीतर खबर पहुंचाएंगे कि मीठा है--मिठाई मुंह पर है, जीभ पर है। लेकिन मन उस खबर को लेने की तैयारी नहीं दिखाएगा। मन भी उस खबर को ले ले तो मन के पीछे जो चेतना है उस का और मन के बीच का सेतु टूट गया है, संबंध टूट गया है। मृत्यु के क्षण में वह संबंध नहीं रह जाता। इसलिए मन भी खबर ले लेगा कि जीभ ने क्या खबर दी है, तो भी चेतना को कोई पता नहीं चलेगा। <br><br>आपके व्यक्तित्व को बदलने के लिए हजारों वर्षों से, जब भी कोई बहुत उलझन होती है तो शाक ट्रीटमेंट का उपयोग करते रहे हैं चिकित्सक--जब भी कोई उलझन होती है तो आपको इतना गहरा धक्का देने का प्रयोग करते रहे हैं, शाक का, और उससे कई बार बहुत गहरी उलझन सुलझ जाती है। और शाक ट्रीटमेंट का कुल अर्थ इतना ही है कि आपकी चेतना और आपके मन का सेतु क्षण भर को टूट जाए। उस सेतु के टूटते ही आपके भीतर की सारी व्यवस्था जैसी कल तक थी रुग्ण, वह अव्यवस्थित हो जाती है, अराजक हो जाती है। और नई व्यवस्था कोई भी रुग्ण नहीं बनाना चाहता। इसलिए शाक ट्रीटमेंट का कुल भरोसा इतना है कि एक बार पुरानी व्यवस्था का ढांचा टूट जाए तो आप फिर शायद उस ढांचे को न बना सकेंगे।  ";

const audio2 = "/mp3/dharam2.mp3"


const Rashprityag = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Rashprityag;



