import MantarComponent from "../components/MantarComponent";

const mainheading = "सामायिकः स्वभाव में ठहर जाना (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "ग्यारहवां या पांचवां अंतर-तप है ध्यान। जो दस तपों से गुजरते हैं उन्हें तो ध्यान को समझना कठिन नहीं होता। लेकिन जो केवल दस तपों को समझ से समझते हैं, उन्हें ध्यान को समझना बहुत कठिन होता है। फिर भी कुछ संकेत ध्यान के संबंध में समझे जा सकते हैं। ध्यान को तो करके ही समझा जा सकता है, इशारे कुछ बाहर से ध्यान के संबंध में समझे जा सकते हैं। ध्यान प्रेम जैसा है--जो करता है, वही जानता है; या तैरने जैसा है--जो तैरता है, वही जानता है। <br><br>तैरेने के संबंध में कुछ बातें कही जा सकती हैं, और प्रेम के संबंध में बहुत बातें कही जा सकती हैं। फिर भी प्रेम के संबंध में कितना भी समझ लिया जाए तो भी प्रेम समझ में नहीं आता। क्योंकि प्रेम एक स्वाद है, एक अनुभव है, एक अस्तित्वगत प्रतीति है। तैरना भी एक एक्झिस्टेंशियल, एक सत्तागत प्रतीति है। आप दूसरे व्यक्ति को तैरते हुए देख कर भी नहीं जान सकते कि वह कैसा अनुभव करता है। आप दूसरे व्यक्ति को प्रेम में डूबा हुआ देख कर भी नहीं जान सकते कि उसे प्रेम किन-किन यात्राओं पर ले जाता है। ध्यान में खड़े महावीर को देख कर भी नहीं जान सकते कि ध्यान क्या है। <br><br>ध्यान के संबंध महावीर स्वयं भी कुछ कहें तो भी नहीं समझा पाते ठीक से कि ध्यान क्या है? कठिनाई और भी बढ़ जाती है, प्रेम से भी ज्यादा, कि चाहे कितना ही कम जानते हों लेकिन प्रेम का कोई न कोई स्वाद हम सबको है। गलत ही सही, गलत प्रेम का ही सही, तो भी प्रेम का स्वाद है। गलत ध्यान का भी हमें कोई स्वाद नहीं है, ठीक ध्यान की बात तो बहुत दूर है। गलत ध्यान का भी हमें कोई स्वाद नहीं है जिसके आधार पर समझाया जा सके कि ठीक क्या है। गलत ध्यान में भी हम अपने को रोक लेते हैं। <br><br>महावीर ने दो तरह के गलत ध्यान भी कहे हैं। महावीर ने कहा है कि जो व्यक्ति तीव्र क्रोध में आ जाता है वह एक तरह के गलत ध्यान में आ जाता है। अगर आप कभी तीव्र क्रोध में आए हैं तो एक प्रकार के गलत ध्यान में आपने प्रवेश किया है। लेकिन हम तीव्र क्रोध में भी कभी नहीं आते। हम कुनकुने जीते हैं, ल्यूकवार्म; कभी हम उबलती हालत में नहीं आते। अगर आप गहरे क्रोध में आ जाएं, इतने गहरे क्रोध में आ जाएं कि क्रोध ही शेष रह जाए, क्रोध ही एकाग्र हो जाए, जीवन की सारी ऊर्जा क्रोध के बिंदु पर ही दौड़ने लगे। सारी किरणें जीवन की शक्ति की क्रोध पर ही ठहर जाएं, तो आपको गलत ध्यान का अनुभव होगा। <br><br>महावीर ने कहा है कि अगर कोई गलत ध्यान में भी उतरे तो उसे ठीक ध्यान में लाना आसान है। इसलिए अकसर ऐसा हुआ है कि परम क्रोधी क्षण भर में परम क्षमा की मूर्ति बन गए। लेकिन धीमे-धीमे जलते हुए जो क्रोधी हैं उन्हें गलत ध्यान का भी कोई पता नहीं है। अगर राग पूरी तरह हो, वासना पूरी तरह हो, पैशन पूरी तरह हो जैसा कि कोई मजनू या फरियाद जब अपने पूरे राग से पागल हो जाता है तब वह भी एक तरह के गलत ध्यान में प्रवेश करता है। तब लैला के सिवाय मजनू को कुछ भी दिखाई नहीं पड़ता--राह चलते दूसरे लोगों में भी वही दिखाई पड़ती है; खड़े हुए वृक्षों में भी वही दिखाई पड़ती है; चांद-तारों में भी वही दिखाई पड़ती है। इसीलिए तो हम उसे पागल कहते हैं। ";

const audio2 = "/mp3/dharam2.mp3"


const Samayik = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Samayik;



