import MantarComponent from "../components/MantarComponent";

const mainheading = "संलीनताः अंतर-तप का प्रवेश-द्वार (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "बाह्य-तप का अंतिम सूत्र, अंतिम अंग है--संलीनता। संलीनता सेतु है, बाह्य-तप और अंतर-तप के बीच। संलीनता के बिना कोई बाह्य-तप से अंतर-तप की सीमा में प्रवेश नहीं कर सकता। इसलिए संलीनता को बहुत ध्यानपूर्वक समझ लेना जरूरी है। संलीनता सीमांत है; वहीं से बाह्य-तप समाप्त होते और अंतर-तप शुरू होते हैं। <br><br>संलीनता का अर्थ और संलीनता का प्रयोग बहुत अदभुत है। परंपरा जितना कहती है, वह तो इतना ही कहती है कि अपने शरीर के अंगों को व्यर्थ संचालित न करना संलीनता है। अकारण शरीर न हिले डुले, संयत हो, तो संलीनता है। इतनी ही बात नहीं, यह तो कुछ भी नहीं है। यह तो संलीनता का बाहर की रूपरेखा को भी स्पर्श करना नहीं है। संलीनता के गहरे अर्थ हैं। तीन हिस्सों में हम इसे समझें--पहला तो आपके शरीर में, आपके मन में, आपके प्राण में कोई भी हलन-चलन नहीं होती है, जब तक आपकी चेतना न कंपे। अंगुली भी हिलती है तो भीतर आत्मा में कंपन पैदा होता है। दिखाई तो अंगुली पड़ती है कि हिली, लेकिन कंपन भीतर से आता है; सूक्ष्म से आता है और स्थूल तक फैल जाता है। इतना ही सवाल नहीं है कि अंगुली न हिले क्योंकि यह हो सकता है अंगुली न हिले लेकिन भीतर कंपन हो। तो कोई अपने शरीर को संलीन करके बैठ जा सकता है, योगासन लगा कर बैठ जा सकता है, अभ्यास कर ले सकता है और शरीर पर कोई भी कंपन दिखाई न पड़े और भीतर तूफान चले, और ज्वालामुखी का लावा उबलता रहे और आग जले। <br><br>संलीनता वस्तुतः तो तब घटित होती है, जब भीतर सब इतना शांत हो जाता है कि भीतर से कोई तरंग नहीं आती जो शरीर पर कंपन बने, लहर बने। पर हमें शरीर से ही शुरू करना पड़ेगा क्योंकि हम शरीर पर ही खड़े हैं। तो संलीनता के अभ्यास में जिसे उतरना हो उसे पहले तो अपनी शरीर की गतिविधियों का निरीक्षण करना होता है। यह पहला हिस्सा है। क्या कभी आपने ख्याल किया है कि जब आप क्रोध में होते हैं तो और ढंग से चलते हैं? जब आप क्रोध में होते हैं तब आपके चेहरे की रेखाएं और हो जाती हैं; आपकी आंख पर अलग रंग फैल जाते हैं; आपके दांतों में कोई गति हो जाती है। आपकी अंगुलियां किसी भार से, शक्ति से भर जाती हैं। आपके समस्त स्नायु मंडल में परिवर्तन हो जाता है। जब आप उदास होते हैं तब आप और ढंग से चलते हैं, आपके पैर भारी हो गए होते हैं, उठाने का मन भी नहीं होता, कहीं जाने का भी मन नहीं होता। आपके प्राण पर जैसे पत्थर रख दिया हो, ऐसी आपकी सारी इंद्रियां पत्थर से दब जाती हैं। जब आप उदास होते हैं तब आपके चेहरे का रंग बदल जाता है, रेखा बदल जाती है। जब आप प्रेम में होते हैं तब, जब आप शांत होते हैं तब, तब सब फर्क पड़ते हैं। लेकिन आपने निरीक्षण न किया होगा। संलीनता का प्रयोग समझना हो तो जब आप क्रोध में हों तो भागें और दर्पण के सामने पहुंच जाएं। और देखें कि चेहरे में कैसी स्थिति है क्योंकि आपका क्रोध से भरा चेहरा दूसरों ने देखा है, आपने नहीं देखा। देखें कि आपका चेहरा कैसा है। जब आप उदास हों तब आईने के सामने पहुंच जाएं और देखें कि आंखें कैसी हैं। जब आप चल रहे हों उदास, तब ख्याल करें कि पैर कैसे पड़ते हैं, शरीर झुका हुआ है, उठा हुआ है। ";

const audio2 = "/mp3/dharam2.mp3"


const Sanlinta = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Sanlinta;



