import MantarComponent from "../components/MantarComponent";

const mainheading = "संयमः मध्य में रुकना(संयम)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "संयम पर आज कुछ समझ लें। क्योंकि महावीर उसे धर्म का दूसरा महत्वपूर्ण सूत्र कहते हैं। अहिंसा आत्मा है, संयम जैसे श्वास और तप जैसे देह। महावीर ने शुरू किया, कहा पहले अहिंसा-संजमो तवो। तप आखिर में कहा, संयम बीच में कहा, अहिंसा पहले कहा। हम जब भी देखते हैं, तप हमें पहले दिखाई पड़ता है। संयम पीछे दिखाई पड़ता है। अहिंसा तो शायद ही दिखाई पड़ती है, बहुत मुश्किल है देखना।<br><br>संयम का महावीर के लिए तो अर्थ है जैसे कोई शक्तिवान अपनी शक्ति में प्रतिष्ठित है। उसकी शक्ति में प्रतिष्ठित होना ही, उसका अपनी ऊर्जा में होना ही वृत्तियों का निर्बल और नपुंसक हो जाना है, इम्पोटेंट हो जाना है। महावीर अपनी कामवासना पर वश पाकर ब्रह्मचर्य को उपलब्ध नहीं होते। ब्रह्मचर्य की इतनी ऊर्जा है कि कामवासना सिर नहीं उठा पाती। यह विधायक अर्थ है। महावीर अपनी हिंसा से लड़ कर अहिंसक नहीं बनते। अहिंसक हैं, इसलिए हिंसा सिर नहीं उठा पाती। महावीर अपने क्रोध से लड़कर क्षमा नहीं करते। क्षमा की इतनी शक्ति है कि क्रोध को उठने का अवसर कहां है! महावीर के लिए अर्थ है स्वयं की शक्ति से परिचित हो जाना संयम है। <br><br>संयम इसे क्यों नाम दिया है? संयम नाम बहुत अर्थपूर्ण है और संयम का, संयम शब्द का अर्थ भी बहुत महत्वपूर्ण है। अंग्रेजी में जितनी भी किताबें लिखी गई हैं और संयम के बाबत जिन्होंने भी लिखा है, उन्होंने उसका अनुवाद कंट्रोल किया है जो कि गलत है। अंग्रेजी में सिर्फ एक शब्द है जो संयम का अनुवाद बन सकता है, लेकिन भाषाशास्त्री को ख्याल में नहीं आएगा। क्योंकि भाषा की दृष्टि से वह ठीक नहीं है। अंग्रेजी में जो शब्द है ट्रैंक्विलिटी, वह संयम का अर्थ हो सकता है। संयम का अर्थ है इतना शांत कि विचलित नहीं होता, जो। संयम का अर्थ है अविचलित, निष्कंप। संयम का अर्थ है ठहरा हुआ। गीता में कृष्ण ने जिसे स्थितप्रज्ञ कहा है, महावीर के लिए वही संयम है। संयम का अर्थ है ठहरा हुआ, अविचलित, निष्कंप, डांवाडोल नहीं होता है, जो। जो यहां-वहां नहीं डोलता रहता, जो कंपित नहीं होता रहता, जो अपने में ठहरा हुआ है। जो पैर जमाकर अपने में खड़ा हुआ है। <br><br>इसे हम और दिशा से समझें तो ख्याल में आ जाएगा। अगर संयम का ऐसा अर्थ है तो असंयम का अर्थ हुआ कंपन, वेवरिंग, ट्रेंबलिंग। यह जो कंपता हुआ मन है, और कंपते हुए मन का नियम है कि वह एक अति से दूसरी अति पर चला जाता है। अगर कामवासना में जाएगा तो अति पर चला जाएगा। फिर ऊबेगा, परेशान होगा क्योंकि किसी भी वासना में होना संभव नहीं है सदा के लिए। सब वासनाएं उबा देती हैं, सब वासनाएं घबड़ा देती हैं क्योंकि उनसे मिलता कुछ भी नहीं है। मिलने के जितने सपने थे, वे और टूट जाते हैं। सिवाय विफलता और विषाद के कुछ हाथ नहीं लगता। तो वासना घिरा मन अति पर जाता है, फिर वासना से ऊब जाता है, घबड़ा जाता है फिर दूसरी अति पर चला जाता है। फिर वह वासना के विपरीत खड़ा हो जाता है। कल तक ज्यादा खाता था, फिर एकदम अनशन करने लगता है। ";

const audio2 = "/mp3/dharam2.mp3"


const Sayam = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Sayam;



