import MantarComponent from "../components/MantarComponent";

const mainheading = "शरणागतिः धर्म का मूल आधार (शरणागति-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="अरिहंते सरणं पवज्जामि। <br>सिद्धे सरणं पवज्जामि। <br>साहू सरणं पवज्जामि। <br>केवलिपन्नत्तं धम्मं सरणं पवज्जामि। <br>अरिहंत की शरण स्वीकार करता हूं। सिद्धों की शरण स्वीकार करता हूं। साधुओं की शरण स्वीकार करता हूं। केवली प्ररूपित अर्थात आत्मज्ञ--कथित धर्म की शरण स्वीकार करता हूं।";
const audio1 = "/mp3/sarnagatimantar1.mp3"

const wholeparagraph = "महावीर का सूत्र है--अरिहंत की शरण स्वीकार करता हूं। इससे लौटना नहीं हो सकता। यह पॉइंट ऑफ नो रिटर्न है। इसके पीछे लौटने का उपाय नहीं है। यह टोटल, यह समग्र छलांग है। शरण जाता हूं, तो अभी काल का व्यवधान होगा, अभी समय लगेगा, शरण तक पहुंचते-पहुंचते। अभी बीच में समय व्यतीत होगा। और आज जो कहता है--शरण जाता हूं, हो सकता है, न मालूम कितने जन्मों के बाद शरण में पहुंच सके। अपनी-अपनी मति पर निर्भर होगा। लेकिन पवज्जामि के सूत्र की खूबी यह है कि वह सडन जंप है। उसमें बीच में फिर समय का व्यवधान नहीं है। स्वीकार करता हूं। और जिसने शरण स्वीकार की, उसने स्वयं को तत्काल अस्वीकार किया। ये दोनों बातें एक साथ नहीं हो सकतीं। तो अगर आप अपने को स्वीकार करते हैं तो शरण को स्वीकार न कर सकेंगे। अगर आप शरण को स्वीकार करते हैं तो अपने को अस्वीकार कर सकेंगे--करना ही होगा। ये एक ही सिक्के के दो पहलू हैं। <br><br>यह सूत्र शरणागति का है। इस सूत्र के साथ नमोकार पूरा होता है। नमस्कार से शुरू होकर शरणागति पर पूरा होता है। और इस अर्थ में नमोकार पूरे धर्म की यात्रा बन जाता है। उस छोटे से सूत्र में पहले से लेकर आखिरी कदम तक सब छोड़ दें कहीं किसी चरण में, छोड़ दें। यह बात प्रयोजनहीन है--कहां छोड़ दें। महत्वपूर्ण यही है कि छोड़ दें। <br><br>तो शरणागति का पहला तो संबंध है--आंतरिक ज्यामिती से कि वह आपके भीतर की चेतना की आकृति बदलती है। दूसरा संबंध है--आपको प्रकृति के साधारण नियमों के बाहर ले जाती है। किसी गहन अर्थ में आप दिव्य हो जाते हैं, शरण जाते हैं। <br><br>आप ट्रांसेंड कर जाते हैं, अतिक्रमण कर जाते हैं--साधारण तथाकथित नियमों का--जो हमें बांधे हुए हैं। और तीसरी बात--शरणागति आपके जीवन द्वारों को परम ऊर्जा की तरफ खोल देती है जैसे कि कोई अपनी आंख को सूरज की तरफ उठा ले। सूरज की तरफ पीठ करने की भी हमें स्वतंत्रता है। सूरज की तरफ पीठ करके भी हम खड़े हो सकते हैं। सूरज की तरफ मुंह करके भी आंख बंद रख सकते हैं। सूरज का अनंत प्रकाश बरसता रहेगा और हम वंचित रह जाएंगे। लेकिन एक आदमी सूरज की तरफ घूम जाता है, जैसे कि सूरजमुखी का फूल घूम गया हो। आंख खोल लेता है, द्वार खुले छोड़ देता है। सूरज का प्रकाश उसके रोएं-रोएं, रंध्र-रंध्र में पहुंच जाता है। उसके हृदय के अंधकारपूर्ण कक्षों तक भी प्रकाश की खबर पहुंच जाती है। वह नया और ताजा, पुनरुज्जीवित हो जाता है। ठीक ऐसे ही विश्व-ऊर्जा के स्रोत हैं और उन विश्व-ऊर्जा के स्रोतों की तरफ स्वयं को खोलना हो तो शरण में जाने के अतिरिक्त और कोई उपाय नहीं है। <br><br>इसलिए अहंकारी व्यक्ति दीन से दीन व्यक्ति है, जिसने अपने को समस्त स्रोतों से तोड़ लिया है। जो सिर्फ अपने पर ही भरोसा कर रहा है। वह ऐसा फूल है जिसने जड़ों से अपने संबंध त्याग दिए। और जिसने सूरज की तरफ मुंह फेरने से अकड़ दिखाई। वर्षा आती है तो अपनी पंखुड़ियां बंद कर लेता है। सड़ेगा, उसका जीवन सिर्फ सड़ने का एक क्रम होगा। उसका जीवन मरने की एक प्रक्रिया होगी। उसका जीवन परम जीवन का मार्ग नहीं बनेगा। लेकिन फूल पाता है रस--जड़ों से, सूर्यों से, चांद-तारों से। अगर फूल समर्पित है तो प्रफुल्लित हो जाता है। सब द्वारों से उसे रोशनी, प्रकाश, जीवन मिलता है। शरणागति का तीसरा और गहनतम जो रूप है, वह प्रकाश, जीवन-ऊर्जा के जो परम स्रोत हैं, जो एनर्जी सोर्सेज हैं--उनकी तरफ अपने को खोलना है। <br><br>एक बात आखिरी--अगर जीसस सूली का चमत्कार दिखा दें और तब आप शरण जाएं तो ध्यान रखना, वह शरणागति नहीं है--ध्यान रखना, वह शरणागति नहीं है। अगर बुद्ध किसी मुर्दे को जिंदा कर दें और आप उनके चरण पकड़ लें तो समझना कि वह शरणागति नहीं है। क्योंकि उसमें कारण बुद्ध हैं, कारण आप नहीं हैं। वह सिर्फ चमत्कार को नमस्कार है। उसमें कोई शरणागति नहीं है। शरणागति तो तब है, जब कारण बुद्ध हैं, कारण आप नहीं हैं। वह सिर्फ चमत्कार को नमस्कार है। उसमें कोई शरणागति नहीं है। शरणागति तो तब है, जब कारण आप हैं, बुद्ध नहीं। इस फर्क को ठीक से समझ लें, नहीं तो सूत्र का राज चूक जाएगा। शरणागति तो तब है, जब कारण आप हैं, बुद्ध नहीं। इस फर्क को ठीक से समझ लें, नहीं तो सूत्र का राज चूक जाएगा। शरणागति तो तब होती है जब आप शरण गए हैं। और शरणागति भी उसी मात्रा में गहन होती है, जिस मात्रा में शरणागति जाने का कोई कारण नहीं होता। जितना कारण होता है उतना ही बार्गेन हो जाता है, उतना तो सौदा हो जाता है। शरणागति नहीं रह जाती। बुद्ध मुर्दे को उठा रहे हैं तो नमस्कार तो करना ही पड़ेगा। इसमें आपकी खूबी नहीं है। इसमें तो कोई भी नमस्कार कर लेगा। इसमें अगर कोई खूबी है तो बुद्ध की है। आपका इसमें कुछ भी नहीं है। लेकिन अदभुत लोग थे, इस दुनिया में। एक वृक्ष को जाकर नमस्कार करते थे, एक पत्थर को। तब-तब खूबी आपकी होनी शुरू हो जाती है। अकारण, जितनी अकारण होगी--शरण की भावना--उतनी गहरी होगी। जितनी सकारण होगी, उतनी उथली हो जाएगी। जब कारण बिल्कुल साफ होते हैं तब बिल्कुल तर्कयुक्त हो जाते हैं, उसमें कोई छलांग नहीं रह जाती। और जब बिल्कुल कारण नहीं होता, तभी छलांग घटित होती है। <br><br>समर्पण यानी श्रद्धा। समर्पण यानी शरणागति। समर्पण यानी अहंकार विसर्जन। नमोकार इस पर पूरा होता है।<br> "


;

const audio2 = "/mp3/sharnagatimix.mp3"


const Sharnagati = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Sharnagati;



