import MantarComponent from "../components/MantarComponent";

const mainheading = "स्वाध्याय"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = "महावीर ने वैयावृत्य के बाद ही जो तप कहा है, वह है स्वाध्याय--चौथा तप। निश्चित ही, अगर सेवा का आप ऐसा प्रयोग करें तो आप स्वाध्याय में उतर जाएंगे, स्वयं के अध्ययन में उतर जाएंगे। लेकिन स्वाध्याय से बड़ा गौण अर्थ लिया जाता रहा है--वह है शास्त्रों का अध्ययन, पठन, मनन। महावीर अध्ययन ही कह सकते थे, स्वाध्याय कहने की क्या जरूरत थी? उसमें स्व जोड़ने का क्या प्रयोजन था? अध्ययन काफी था। स्वयं का अध्ययन, स्वाध्याय का अर्थ होता है। शास्त्र का अध्ययन नहीं। लेकिन साधु शास्त्र खोल बैठे हैं सुबह से, उनसे पूछिए--क्या कर रहे हैं? वे कहते हैं--स्वाध्याय करते हैं। शास्त्र निश्चित ही किसी और का होगा। स्वाध्याय शास्त्र नहीं बन सकता। अगर खुद का ही लिखा शास्त्र पढ़ रहे हैं तो बिल्कुल बेकार पढ़ रहे हैं। क्योंकि खुद का ही लिखा हुआ है, अब उसमें और पढ़ने को क्या बचा होगा? जानने को क्या है? <br><br>स्वाध्याय का अर्थ हैः स्वयं का अध्ययन। बड़ा कठिन है। शास्त्र पढ़ना तो बड़ा सरल है। जो भी पढ़ सकता है, वह शास्त्र पढ़ सकता है। पठित होना काफी है, लेकिन स्वाध्याय के लिए पठित होना काफी नहीं है। क्योंकि स्वाध्याय बहुत जटिल मामला है। आप बहुत कांप्लेक्स हैं, आप बहुत उलझे हुए हैं। आप एक ग्रंथियों का जाल हैं। आप एक पूरी दुनिया हैं, हजार तरह के उपद्रव हैं वहां। उस सबके अध्ययन का नाम स्वाध्याय है। तो अगर आप अपने क्रोध का अध्ययन कर रहे हैं तो स्वाध्याय कर रहे हैं। हां, क्रोध के संबंध में शास्त्र में क्या लिखा है, उसका अध्ययन कर रहे हैं तो स्वाध्याय नहीं कर रहे हैं। अगर आप अपने राग का अध्ययन कर रहे हैं तो स्वाध्याय कर रहे हैं। राग के संबंध में शास्त्र में क्या लिखा है, उसका अध्ययन कर रहे हैं तो स्वाध्याय नहीं कर रहे हैं। और आपके भीतर सब मौजूद है, जो भी किसी शास्त्र में लिखा है वह सब आपके भीतर मौजूद है। इस जगत में जितना भी जाना गया है, वह प्रत्येक आदमी के भीतर मौजूद है। और इस जगत में जो भी कभी जाना जाएगा वह प्रत्येक आदमी के भीतर आज भी मौजूद है। आदमी एक शास्त्र है--परम शास्त्र है, द अल्टीमेट स्क्रिप्चर। इस बात को समझें तो महावीर का स्वाध्याय समझ में आएगा। <br><br>मनुष्य परम शास्त्र है। क्योंकि जो भी जाना गया है, वह मनुष्य ने जाना। जो भी जाना जाएगा वह मनुष्य जानेगा। काश, मनुष्य स्वयं को ही जान ले, तो जो भी जाना गया है और जो भी जाना जा सकता है वह सब जान लिया जाता है। इसलिए महावीर ने कहा है--एक को जानने से सब जान लिया जाता है। स्वयं को जानने से सर्व जान लिया जाता है। इसके कई आयाम हैं। पहली तो बात यह है कि जानने योग्य जो भी है उसके हम दो हिस्से कर सकते हैं--एक तो आब्जेक्टिव, वस्तुगत; दूसरा सब्जेक्टिव, आत्मगत। जानने में दो घटनाएं घटती हैं--जानने वाला होता है और जानी जाने वाली चीज होती है। विषय होता है जिसे हम जानते हैं, और जानने वाला होता है जो जानता है। विज्ञान का संबंध विषय से है, आब्जेक्ट से है, वस्तु से है। जिसे हम जानते हैं उसे जानने से है। धर्म का संबंध उसे जानने से है जिससे हम जानते हैं; जो जानता है उसे जानने से है।<br><br> ज्ञाता को जानना धर्म है और ज्ञेय को जानना विज्ञान है। ज्ञेय को हम कितना ही जान लें तो ज्ञाता के संबंध में तो भी पता नहीं चलता। कितना ही हम जान लें चांद-तारे, सूरजों के संबंध में तो भी अपने संबंध में कुछ पता नहीं चलता। बल्कि एक बड़े मजे की बात है कि जितना हम वस्तुओं के संबंध में ज्यादा जान लेते हैं उतना ही हमें वह भूल जाता है, जो जानता है। क्योंकि जानकारी बहुत इकट्ठी हो जाए तो ज्ञाता छिप जाता है। आप इतनी चीजों के संबंध में जानते हैं कि आपको ख्याल ही नहीं रहता कि अभी जानने को कुछ शेष बच रहा है इसलिए विज्ञान बढ़ता जाता है रोज, जानता जाता है रोज। कितने प्रकार के मच्छर हैं, विज्ञान जानता है। प्रत्येक प्रकार के मच्छर की क्या खूबियां है, विज्ञान जानता है। कितने प्रकार की वनस्पतियां हैं, विज्ञान जानता है। प्रत्येक वनस्पति में क्या-क्या छिपा है, विज्ञान जानता है। कितने सूरज हैं, कितने तारे हैं, कितने चांद हैं, विज्ञान जानता है। ";

const audio2 = "/mp3/dharam2.mp3"


const Swadhaya = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Swadhaya;



