import MantarComponent from "../components/MantarComponent";

const mainheading = "ऊणोदरी (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = " अनशन के बाद महावीर ने दूसरा बाह्य-तप ऊणोदरी कहा है। ऊणोदरी का अर्थ हैः अपूर्ण भोजन, अपूर्ण आहार। आश्चर्य होगा कि अनशन के बाद ऊणोदरी के लिए क्यों महावीर ने कहा है! अनशन का अर्थ तो है निराहार। अगर ऊणोदरी को कहना भी था तो अनशन के पहले कहना था, थोड़ा आहार। और आमतौर से जो लोग भी अनशन का अभ्यास करते हैं वे पहले ऊणोदरी का अभ्यास करते हैं। वे पहले आहार को कम करने की कोशिश करते हैं। जब आहार कम में सुविधा हो जाती है, आदत हो जाती है तभी वे अनशन का प्रयोग करते हैं और वह बिल्कुल ही गलत है। महा वीर ने जान कर ही पहले अनशन कहा और फिर ऊणोदरी कहा। ऊणोदरी का अभ्यास आसान है। लेकिन एक बार ऊणोदरी का अभ्यास हो जाए तो अभ्यास हो जाने के बाद अनशन का कोई अर्थ, कोई प्रयोजन नहीं रह जाता। वह मैंने आपसे कल कहा कि अनशन तो जितना आकस्मिक हो और जितना अभ्यासशून्य हो, जितना प्रयत्नरहित हो, जितना अव्यवस्थित और अराजक हो, उतनी ही बड़ी छलांग भीतर दिखाई पड़ती है।<br><br> ऊणोदरी को द्वितीय नंबर महावीर ने दिया है, उसका कारण समझ लेना जरूरी है। ऊणोदरी शब्द का तो इतना ही अर्थ होता है कि जितना पेट मांगे उतना नहीं देना। लेकिन आपको यह पता ही नहीं है कि पेट कितना मांगता है। और अक्सर जितना मांगता है वह पेट नहीं मांगता है, वह आपकी आदत मांगती है। और आदत में और स्वभाव में फर्क न हो तो अत्यंत कठिन हो जाएगी बात। जब रोज आपको भूख लगती है, तो आप इस भ्रम में मत रहना कि भूख लगती है। स्वाभाविक भूख तो बहुत मुश्किल से लगती है; नियम से बंधी हुई भूख रोज लग आती है।<br><br> ऊणोदरी को द्वितीय नंबर महावीर ने दिया है, उसका कारण समझ लेना जरूरी है। ऊणोदरी शब्द का तो इतना ही अर्थ होता है कि जितना पेट मांगे उतना नहीं देना। लेकिन आपको यह पता ही नहीं है कि पेट कितना मांगता है। और अक्सर जितना मांगता है वह पेट नहीं मांगता है, वह आपकी आदत मांगती है। और आदत में और स्वभाव में फर्क न हो तो अत्यंत कठिन हो जाएगी बात। जब रोज आपको भूख लगती है, तो आप इस भ्रम में मत रहना कि भूख लगती है। स्वाभाविक भूख तो बहुत मुश्किल से लगती है; नियम से बंधी हुई भूख रोज लग आती है।";

const audio2 = "/mp3/dharam2.mp3"


const Sanlinta = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Sanlinta;



