import MantarComponent from "../components/MantarComponent";

const mainheading = "वृत्ति-संक्षेप (धम्म-सूत्र)"
const url = "/mahaveer_img/devta.jpg";
const content ="धम्मो मंगलमुक्किट्ठं, <br> अहिंसा संजमो तवो। <br>देवा वि तं नमंसन्ति, <br>जस्स धम्मे सया मणो।। <br>         धर्म सर्वश्रेष्ठ मंगल है। (कौन सा धर्म?) अहिंसा, संयम और तपरूप धर्म। जिस मनुष्य का मन उक्त धर्म में सदा संलग्न रहता है, उसे देवता भी नमस्कार करते हैं। ";
const audio1 = "/mp3/dhamomangal.mp3"

const wholeparagraph = " महावीर का तीसरा सूत्र है, वृत्ति-संक्षेप। वृत्ति-संक्षेप से परंपरागत जो अर्थ लिया जाता है वह यह है कि अपनी वृत्तियों और वासनाओं को सिकोड़ना। अगर दस कपड़ों से काम चल सकता है तो ग्यारह पास में न रखना। अगर एक बार भोजन से काम चल सकता है तो दो बार भोजन न करना। ऐसा साधारण अर्थ है, लेकिन वह अर्थ केंद्र से संबंधित न होकर केवल परिधि से संबंधित है। नहीं, महावीर का अर्थ गहरा है और दूसरा है। इसे थोड़ा गहरे में समझना पड़ेगा।<br><br>वृत्ति-संक्षेप एक प्रक्रिया है। आपके भीतर प्रत्येक वृत्ति का केंद्र है--जैसे, सेक्स का एक केंद्र है, भूख का एक केंद्र है, प्रेम का एक केंद्र है, बुद्धि का एक केंद्र है। लेकिन साधारणतः हमारे सारे केंद्र कनफ्यूज्ड हैं क्योंकि एक केंद्र का काम दूसरे केंद्र से हम लेते रहते हैं। दूसरे का तीसरे से लेते रहते हैं। काम भी नहीं हो पाता है, और केंद्र की शक्ति भी व्यय और व्यर्थ नष्ट होती है। गुरजिएफ कहा करता था--गुरजिएफ ने वृत्ति-संक्षेप के प्रयोग को बहुत आधारभूत बनाया था अपनी साधना में। गुरजिएफ कहा करता था कि पहले तो तुम अपने प्रत्येक केंद्र को स्पष्ट कर लो और प्रत्येक केंद्र के काम को उसी को सौंप दो, दूसरे केंद्र से काम मत लो। अब जैसे कामवासना है तो उसका अपना केंद्र है प्रकृति में, लेकिन आप मन से उस केंद्र का काम लेते हैं, सेरिब्रल हो जाता है सेक्स, मन में ही सोचते रहते हैं। कभी-कभी तो इतना सेरिब्रल हो जाता है कि वास्तविक कामवासना उतना रस नहीं देती, जितना कामवासना का चिंतन रस देता है। अब यह बहुत अजीब बात है। यह ऐसा हुआ है कि वास्तविक भोजन रस नहीं देता, जितना भोजन का चिंतन रस देता है। यह ऐसे हुआ है कि पहाड़ पर जाने में उतना मजा नहीं आता जितना घर बैठ कर पहाड़ पर जाने के संबंध में सोचने में, सपने देखने में मजा आता है। और हम प्रत्येक केंद्र को ट्रांसफर करते हैं, दूसरे केंद्र पर सरका देते हैं; इससे खतरे होते हैं। दो खतरे होते हैं--एक खतरा तो यह होता है कि जिस केंद्र का काम नहीं है, अगर उस पर हम कोई दूसरा काम डाल देते हैं तो वह उसे पूरी तरह तो कर नहीं सकता, वह उसका काम नहीं है। वह कभी नहीं कर सकता। इसलिए सदा अतृप्त बना रहेगा, तृप्त कभी नहीं हो सकता है। कहीं बुद्धि से सोच-सोच कर भूख तृप्त हो सकती है? कहीं कामवासना का चिंतन कामवासना को तृप्त कर सकता है? कैसे करेगा, वह उस केंद्र का काम ही नहीं है। वह तो ऐसा है जैसे कोई आदमी सिर के बल चलने की कोशिश करे। काम पैर का है, वह सिर से चलने की कोशिश करे। तो दोहरे दुष्परिणाम होंगे। जिस केंद्र से आप दूसरे केंद्र का काम ले रहे हैं, वह कर नहीं सकता है, एक। जो वह कर सकता था वह भी नहीं कर पाएगा। क्योंकि आप उसको ऐसे काम में लगा रहे हैं, उसकी शक्ति उसमें व्यय हो तो जो वह कर सकता था, नहीं कर पाएगा। और जिस केंद्र से आपने काम छीन लिया है, उस पर शक्ति इकट्ठी होती रहेगी। वह धीरे-धीरे विक्षिप्त होने लगेगा, क्योंकि उससे आप काम नहीं ले रहे हैं। आप पूरे के पूरे कनफ्यूज्ड हो जाएंगे। आप का व्यक्तित्व एक उलझाव हो जाएगा, एक सुलझाव नहीं। ";

const audio2 = "/mp3/dharam2.mp3"


const Vartisanshep = () => {
  return (
    <div>
      <MantarComponent
        mainheading={mainheading }
        // heading={heading}
        wholeparagraph={{ __html: wholeparagraph }}
        url={url}
        content={content}
        audio1={audio1}
        audio2={audio2}

      />
    </div>
  );
};

export default Vartisanshep;



